#!/usr/bin/env python
#
# exportstack.py
# Copyright (C) 2010, 2013 Carl Pulley <c.j.pulley@hud.ac.uk>
#
# This program is free software; you can redistribute it and/or modify
# it under the terms of the GNU General Public License as published by
# the Free Software Foundation; either version 2 of the License, or (at
# your option) any later version.
#
# This program is distributed in the hope that it will be useful, but
# WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU
# General Public License for more details. 
#
# You should have received a copy of the GNU General Public License
# along with this program; if not, write to the Free Software
# Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA 02111-1307 USA 
#

"""
Code to parse and search _ETHREAD stacks.

Based on preliminary work done by Carl Pulley for Honeynet Challenge 3 (Banking Troubles).

@author:       Carl Pulley
@license:      GNU General Public License 2.0 or later
@contact:      c.j.pulley@hud.ac.uk
@organization: University of Huddersfield

DEPENDENCIES:
  distorm3
  yara

REFERENCES:
[1] Russinovich, M., Solomon, D.A. & Ionescu, A. (2009). Windows Internals: 
    Including Windows Server 2008 and Windows Vista, Fifth Edition (Pro 
    Developer) 5th ed. Microsoft Press.
[2] Hewardt, M. & Pravat, D. (2007). Advanced Windows Debugging 1st ed. 
    Addison-Wesley Professional.

        yield Gadget(frame.start, frame.stack_base, frame.stack_limit, frame.eproc, rop_size=self.rop_size)
    raise StopIteration

  def exec_addr(self):
    return "ROP [{0:#x} B]: ".format(self.rop_size) + ("{0:#010x}".format(self.caller) if self.caller != None else "-"*10)

class CALL_RET(PAGE_EXECUTE):
  """
  ADDR (CALL xxx)    RET: xxx    symbol_lookup(xxx)    [PAGE_EXECUTE(ADDR); *(ADDR-size(CALL xxx)) == CALL xxx]
  Any stack address that belongs to an executable page (i.e. a RET address) and has a CALL 
  instruction as its prior instruction is taken to be a CALL/RET frame.
  """
  def __init__(self, start, stack_base, stack_limit, eproc, instr=None, caller=None, *args, **kwargs):
    if not distorm3_installed:
      debug.error("In order to detect CALL/RET frames, you need to install distorm3")
    PAGE_EXECUTE.__init__(self, start, stack_base, stack_limit, eproc, *args, **kwargs)

    memory_model = self.addrspace.profile.metadata.get('memory_model', '32bit')
    if memory_model == '32bit':
      self.mode = distorm3.Decode32Bits
    else:
      self.mode = distorm3.Decode64Bits
    self.caller = caller
    self.instr = instr

  def check(self, addr):
    self.caller = None
    self.instr = None
    if addr == None:
      return False
    # We only need the last 16 bytes, since this is the largest size the (prior) x86 instruction can be
    code = self.addrspace.zread(addr-16, 16)
    for size in range(0, 16):
      instrs = distorm3.Decompose(addr-size-1, code[-(size+1):], self.mode)
      op = instrs[-1]
      if not op.valid:
        continue
      if op.flowControl == 'FC_NONE':
        return False
      if op.flowControl == 'FC_CALL':
        self.instr = op
        # if the CALL instruction has a determinate target, set caller to it
        if [ o.type for o in op.operands ] == ["Immediate"]:
          self.caller = op.operands[0].value
        elif [ o.type for o in op.operands ] == ["AbsoluteMemoryAddress"]:
          self.caller = self.start + op.disp
        return True
    return False

  def up(self):
    for frame in PAGE_EXECUTE.up(self):
      if self.check(frame.caller):
        yield CALL_RET(frame.start, frame.stack_base, frame.stack_limit, frame.eproc, instr=self.instr, caller=self.caller)
    raise StopIteration

  def down(self):
    for frame in PAGE_EXECUTE.down(self):
      if self.check(frame.caller):
        yield CALL_RET(frame.start, frame.stack_base, frame.stack_limit, frame.eproc, instr=self.instr, caller=self.caller)
    raise StopIteration

  def exec_addr(self):
    if self.caller != None:
      return "CALL: {0:#010x}".format(self.caller)
    else:
      return "-"

  def __repr__(self):
    if self.instr != None:
      return "{0:#010x} ({1})".format(self.start, self.instr)
    else:
      return PAGE_EXECUTE.__repr__(self)

#--------------------------------------------------------------------------------
# profile modifications  
#--------------------------------------------------------------------------------

# Extension methods for the profiles EPROCESS (injected by StackModification)
class StackEPROCESS(windows._EPROCESS):
  def search_stack_frames(self, start, stack_base, stack_limit, yara_rules, frame_delta=32,   unwind=DEFAULT_UNWIND):
    """ 
    Use Yara to search kernel/user stack frames within +/- frame_delta of the frame's start  
    address.
  
    Frames to search are chosen by using the strategies specifed by the unwind parameter.
  
    yara_rules - compiled Yara rules, built for example with:
       1. yara.compile("/path/to/yara.rules")
    or 2. yara.compile(source="rule dummy { condition: true }")
    """
  
    if not yara_installed:
      debug.error("In order to search the stack frames, it is necessary to install yara")
  
    stack_registry = registry.get_plugin_classes(StackTop)
    
    for unwind_strategy_nm in unwind.split(","):
      if unwind_strategy_nm not in stack_registry:
        raise ValueError("{0} is not a known stack unwind strategy".format(unwind_strategy_nm))
      unwind_strategy = stack_registry[unwind_strategy_nm](start, stack_base, stack_limit, self)
      for frame in itertools.chain(unwind_strategy.up(), unwind_strategy.down()):
        search_data = self.get_process_address_space().zread(frame.start - frame_delta, 2* frame_delta)
        for match in yara_rules.match(data = search_data):
          for moffset, name, value in match.strings:
            # Match offset here is converted into frame start address and a +/- frame_delta
            yield match, name, value, frame.start, moffset-frame_delta
  
    raise StopIteration

class StackLDR_DATA_TABLE_ENTRY(pe_vtypes._LDR_DATA_TABLE_ENTRY):
  def load_config(self):
    """Return the IMAGE_LOAD_CONFIG_DIRECTORY for load config"""
    return self._directory(10) # IMAGE_DIRECTORY_ENTRY_LOAD_CONFIG

  def get_load_config_directory(self):
    """Return the load config object for this PE"""
    try:
      load_config = self.load_config()
    except ValueError, why:
      return obj.NoneObject(str(why))

    return obj.Object("_IMAGE_LOAD_CONFIG_DIRECTORY", offset=self.DllBase + load_config.VirtualAddress, vm=self.obj_native_vm)

class StackModification(obj.ProfileModification):
  before = ["WindowsObjectClasses"]

  conditions = {'os': lambda x: x == 'windows'}

  def modification(self, profile):
    for func in StackEPROCESS.__dict__:
      if isfunction(StackEPROCESS.__dict__[func]):
        setattr(profile.object_classes['_EPROCESS'], func, StackEPROCESS.__dict__[func])
    for func in StackLDR_DATA_TABLE_ENTRY.__dict__:
      if isfunction(StackLDR_DATA_TABLE_ENTRY.__dict__[func]):
        setattr(profile.object_classes['_LDR_DATA_TABLE_ENTRY'], func, StackLDR_DATA_TABLE_ENTRY.__dict__[func])

class StackModification32bit(obj.ProfileModification):
  conditions = {'os': lambda x: x == 'windows', 'memory_model': lambda x: x == '32bit'}

  def modification(self, profile):
    profile.vtypes.update({
      '_IMAGE_LOAD_CONFIG_DIRECTORY': [ 0x48, {
      'Size': [ 0x0, ['unsigned int']],
      'TimeDateStamp': [ 0x4, ['unsigned int']],
      'MajorVersion': [ 0x8, ['unsigned short']],
      'MinorVersion': [ 0xa, ['unsigned short']],
      'GlobalFlagsClear': [ 0xc, ['unsigned int']],
      'GlobalFlagsSet': [ 0x10, ['unsigned int']],
      'CriticalSectionDefaultTimeout': [ 0x14, ['unsigned int']],
      'DeCommitFreeBlockThreshold': [ 0x18, ['unsigned int']],
      'DeCommitTotalFreeThreshold': [ 0x1c, ['unsigned int']],
      'LockPrefixTable': [ 0x20, ['unsigned int']],
      'MaximumAllocationSize': [ 0x24, ['unsigned int']],
      'VirtualMemoryThreshold': [ 0x28, ['unsigned int']],
      'ProcessHeapFlags': [ 0x2c, ['unsigned int']],
      'ProcessAffinityMask': [ 0x30, ['unsigned int']],
      'CSDVersion': [ 0x34, ['unsigned short']],
      'Reserved1': [ 0x36, ['unsigned short']],
      'EditList': [ 0x38, ['unsigned int']],
      'SecurityCookie': [ 0x3c, ['unsigned int']], # pointer to ___security_cookie
      'SEHandlerTable': [ 0x40, ['unsigned int']],
      'SEHandlerCount': [ 0x44, ['unsigned int']],
      }],
    })

class StackModification64bit(obj.ProfileModification):
  conditions = {'os': lambda x: x == 'windows', 'memory_model': lambda x: x == '64bit'}
  
  def modification(self, profile):
    profile.vtypes.update({
      '_IMAGE_LOAD_CONFIG_DIRECTORY': [ 0x74, {
      'Size': [ 0x0, ['unsigned int']],
      'TimeDateStamp': [ 0x4, ['unsigned int']],
      'MajorVersion': [ 0x8, ['unsigned short']],
      'MinorVersion': [ 0xa, ['unsigned short']],
      'GlobalFlagsClear': [ 0xc, ['unsigned int']],
      'GlobalFlagsSet': [ 0x10, ['unsigned int']],
      'CriticalSectionDefaultTimeout': [ 0x14, ['unsigned int']],
      'DeCommitFreeBlockThreshold': [ 0x1c, ['unsigned long long']],
      'DeCommitTotalFreeThreshold': [ 0x24, ['unsigned long long']],
      'LockPrefixTable': [ 0x2c, ['unsigned long long']],
      'MaximumAllocationSize': [ 0x34, ['unsigned long long']],
      'VirtualMemoryThreshold': [ 0x3c, ['unsigned long long']],
      'ProcessAffinityMask': [ 0x44, ['unsigned long long']],
      'ProcessHeapFlags': [ 0x4c, ['unsigned int']],
      'CSDVersion': [ 0x50, ['unsigned short']],
      'Reserved1': [ 0x52, ['unsigned short']],
      'EditList': [ 0x54, ['unsigned long long']],
      'SecurityCookie': [ 0x5c, ['unsigned long long']],
      'SEHandlerTable': [ 0x64, ['unsigned long long']],
      'SEHandlerCount': [ 0x6c, ['unsigned long long']],
      }],
    })

#--------------------------------------------------------------------------------
# main plugin code
#--------------------------------------------------------------------------------

class ExportStack(threads.Threads):
  """
  This plugin is an extension of Michael Hale Ligh's threads plugin (see
  http://code.google.com/p/volatility/wiki/CommandReference).

  Given a PID or _EPROCESS object (kernel address), display information 
  regarding the user and kernel stacks, etc. for the processes threads.

  Support is provided for: EBP chains; PAGE_EXECUTE; ROP Gadgets; EBP frames 
  with /GS information; CALL/RET frames; and _EXCEPTION_REGISTRATION_RECORD 
  unwinds. Alternative unwind strategies are easily added.

  By default, EBP chains, CALL/RET frames and _EXCEPTION_REGISTRATION_RECORD 
  unwinds are performed.

  Where possible, executable stack addresses are resolved to module and function 
  names using the symbols.Symbols plugin.
  """

  def __init__(self, config, *args, **kwargs):
    threads.Threads.__init__(self, config, *args, **kwargs)

    if not yara_installed:
      debug.warning("In order to search the stack frames, it is necessary to install yara - searching is disabled")

    config.add_option('UNWIND', default = DEFAULT_UNWIND, help = 'List of frame unwinding strategies (comma-separated)', action = 'store', type = 'str')
    config.add_option('LISTUNWINDS', default = False, help = 'List all known frame unwinding strategies', action = 'store_true')
    config.add_option("SYMBOLS", default = False, action = 'store_true', cache_invalidator = False, help = "Use symbol servers to resolve process addresses to module names (we assume symbol tables have already been built)")

    stack_registry = registry.get_plugin_classes(StackTop)

    if getattr(config, 'LISTUNWINDS', False):
      print "Stack Frame Unwind Strategies:\n"
      for cls_name, cls in sorted(stack_registry.items(), key=lambda v: v[0]):
        if cls_name not in ["UserFrame", "KernelFrame"]:
          print "{0:<20}: {1}\n".format(cls_name, pydoc.getdoc(cls))
      sys.exit(0)

    self.kernel_strategies = []
    self.user_strategies = []
    for strategy in getattr(config, 'UNWIND', DEFAULT_UNWIND).split(","):
      if ":" in strategy:
        if strategy.startswith("kernel:"):
          strategy = strategy[len("kernel:"):]
          if strategy not in stack_registry or not issubclass(stack_registry[strategy], KernelFrame):
            debug.error("{0} is not a valid kernel stack unwinding strategy".format(strategy))
          self.kernel_strategies.append(stack_registry[strategy])
        elif strategy.startswith("user:"):
          strategy = strategy[len("user:"):]
          if strategy not in stack_registry or not issubclass(stack_registry[strategy], UserFrame):
            debug.error("{0} is not a valid user stack unwinding strategy".format(strategy))
          self.user_strategies.append(stack_registry[strategy])
        else:
          debug.error("{0} is an unrecognised stack".format(strategy.split(":")[0]))
      elif strategy not in stack_registry:
        debug.error("{0} is neither a valid kernel nor user stack unwinding strategy".format(strategy))
      elif not issubclass(stack_registry[strategy], KernelFrame) and not issubclass(stack_registry[strategy], UserFrame):
        debug.error("{0} is neither a valid kernel nor stack unwinding strategy".format(strategy))
      else:
        if issubclass(stack_registry[strategy], KernelFrame):
          self.kernel_strategies.append(stack_registry[strategy])
        if issubclass(stack_registry[strategy], UserFrame):
          self.user_strategies.append(stack_registry[strategy])

    self.use_symbols = getattr(config, 'SYMBOLS', False)

    # Determine which filters the user wants to see
    if getattr(config, 'FILTER', None):
      self.filters = set(config.FILTER.split(','))
    else:
      self.filters = set()

